<header class="header">
  <h1 class="page-title">
    <?= __('小谷はり灸所') ?>
  </h1>

  <button id="toggle-navigation-button" class="toggle-navigation-button">
    <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" width="16" height="16">
      <path d="M8 15A7 7 0 1 1 8 1a7 7 0 0 1 0 14zm0 1A8 8 0 1 0 8 0a8 8 0 0 0 0 16z" />

      <path d="m8.93 6.588-2.29.287-.082.38.45.083c.294.07.352.176.288.469l-.738 3.468c-.194.897.105 1.319.808 1.319.545 0 1.178-.252 1.465-.598l.088-.416c-.2.176-.492.246-.686.246-.275 0-.375-.193-.304-.533L8.93 6.588zM9 4.5a1 1 0 1 1-2 0 1 1 0 0 1 2 0z" />
    </svg>

    <span class="toggle-navigation-button-label">
      <?= __('メニュー') ?>
    </span>
  </button>
</header>

<nav id="navigation-container" class="navigation-container">
  <div class="navigation-background-layer"></div>

  <div class="navigation-content">
    <div class="navigation-action-list">
      <span class="navigation-action" data-target="#section-0">
        <?= __('トップ') ?>
      </span>

      <span class="navigation-action" data-target="#section-2">
        <?= __('当院の特色') ?>
      </span>

      <span class="navigation-action" data-target="#section-3">
        <?= __('診療科目') ?>
      </span>

      <span class="navigation-action" data-target="#section-4">
        <?= __('メディア紹介') ?>
      </span>

      <span class="navigation-action" data-target="#section-5">
        <?= __('アクセス') ?>
      </span>

      <span class="navigation-action" data-target="#section-6">
        <?= __('診療時間') ?>
      </span>

      <span class="navigation-action" data-target="#section-7">
        <?= __('診療費') ?>
      </span>

      <span class="navigation-action" data-target="#section-8">
        <?= __('けんこかわら版') ?>
      </span>
    </div>

    <h2 class="navigation-shop-name">
      <?= __('小谷はり灸所') ?>
    </h2>

    <div class="navigation-contact-list">
      <span class="navigation-contact" data-icon="pin">
        <?= __('大阪府堺市東区大美野 158-23') ?>
      </span>

      <span class="navigation-contact" data-icon="walk">
        <?= __('南海バス北野田線 西口園バス停から徒歩2分') ?>
      </span>

      <a href="tel:+81722375695" class="navigation-contact" data-icon="tel">
        <?= __('072-237-5695') ?>
      </a>
    </div>
  </div>
</nav>

<main class="main">
  <section id="section-0" class="section" data-section-index="0">
    <h1 class="section-title">
      <?= __('小谷はり灸所') ?>
    </h1>
  </section>

  <section id="section-1" class="section" data-section-index="1">
    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('この堺の地で地元の方に安心して来院して頂けるよう、自宅に併設した治療所を開業し、２９年目を迎えました。')),
        sprintf('<p>%s</p>', __('漢方に基づいた「脈」や「舌診」を使って身体の状態を細かく把握し、バランスの取れた治療を提供できるよう、日々邁進しております。')),
        sprintf('<p>%s</p>', __('古来中国から伝承された本格的な鍼灸治療で、患者様の身体の状態を整えることが私の最大の喜びです。')),
        sprintf('<p>%s</p>', __('肩こり、腰痛、神経のお悩みなど痛みを生じる不調から、ホルモンバランスの乱れ、更年期など女性特有のお悩みまで、さまざまなお悩みに対応いたします。')),
        sprintf('<p>%s</p>', __('また、何となく身体の調子が悪いと感じる方もお任せください。')),
        sprintf('<p>%s</p>', __('当院では、幅広いお悩みに対応し、元気な生活が送れるようサポートさせていただきます。')),
      ]) ?>
    </div>
  </section>

  <section id="section-2" class="section" data-section-index="2">
    <h1 class="section-title">
      <?= __('当院の特色') ?>
    </h1>

    <h2 class="section-subtitle">
      <?= __('古来中国から伝承された鍼灸治療') ?>
    </h2>

    <div class="section-gallery">
      <div class="section-gallery-image-list">
        <img src="<?= $this->Url->image('section2_gallery1_image1.20211027.jpg') ?>" width="384" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('section2_gallery1_image2.20211028.jpg') ?>" width="192" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('section2_gallery1_image3.20211028.jpg') ?>" width="384" height="256" loading="lazy" class="section-gallery-image">
      </div>
    </div>

    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('宗師から伝承された総合鍼灸治療を行っています。')),
        sprintf('<p>%s</p>', __('宮廷技術「推拿」を取り入れています。')),
      ]) ?>
    </div>

    <h2 class="section-subtitle">
      <?= __('漢方薬でも使用される診察法') ?>
    </h2>

    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('「脈診」や「舌診」を使い、体の全体を把握し、患者様に一番適した鍼灸治療を行います。')),
      ]) ?>
    </div>

    <h2 class="section-subtitle">
      <?= __('生活で使える健康法指導') ?>
    </h2>

    <div class="section-gallery">
      <div class="section-gallery-image-list">
        <img src="<?= $this->Url->image('section2_gallery3_image1.20211028.jpg') ?>" width="384" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('section2_gallery3_image2.20211028.jpg') ?>" width="384" height="256" loading="lazy" class="section-gallery-image">
      </div>
    </div>

    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('病には、必ず原因があります。それを取り除くことが健康への第一歩です。')),
        sprintf('<p>%s</p>', __('体質を改善するための健康法をお伝えいたします。')),
      ]) ?>
    </div>
  </section>

  <section id="section-3" class="section" data-section-index="3">
    <h1 class="section-title">
      <?= __('診療科目') ?>
    </h1>

    <div class="section-category-list">
      <div class="section-category">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 218.08 250.27" fill="#ed7a9e" class="section-category-image">
          <path d="M47.08,115.54c-7.69,8.55-22,1.81-28.36,15-11.87,24.67,10.75,40,29.36,51,6.34,3.57,14.23,10,22,9.49,8.58-.44,15.58-12.94,19.33-19.49,11.33-19.77,24.28-45.44,18.67-69-24,4.83-24.72,46.42-47,54,.84-7.63,7.76-12.76,11.78-19,6.59-10.2,12.67-21.22,20-30.91,7.5-9.95,16.25-16.6,20.22-29.09,4-13,4.38-27-.41-40A58,58,0,0,0,92.08,10.59c-8.22-5.81-17.12-8.8-27-10C33.74-3.95,3.41,19.94.25,51.54-2.44,78.54,16.67,114.89,47.08,115.54Z" />
          <path d="M132.08,86.54h1l11-33,21,4,3-31c6.93.06,18.89,4.69,20-5-5.28-.71-23.15-7.19-27-2.39-5,6.13,2.29,19.8-4.59,25.7-4.74,4.07-13-2.64-18,0-3.19,1.71-3.13,7.64-3.56,10.64C133.52,65.78,132.08,76.21,132.08,86.54Z" />
          <path d="M165.08,62.54c-10.27,4.21-19.61,27.7-22,38l23.43-24.6,17.57,8.6,13-28c6,3.35,16.28,11.22,21,3-4.72-3.2-17.73-14.26-23.79-12.28-11.91,3.89-4.21,29.34-23.21,19.81A20.48,20.48,0,0,1,165.08,62.54Z" />
          <path d="M114.08,103.54c7.28,23.32-10.29,55.59-22.32,75-5.92,9.58-10.09,18.39-22.68,18.55-19.48.23-38.28-21.48-53-31.55l6,84h80c5,0,22.78,2.71,25.41-2.31,3.19-6.08,1.59-16.07,1.59-22.69,0-17.31.47-34.76-1.17-52-.83-7.64-6.57-23.65.17-29.35,8.57-7,39-5.65,47.62,1.08,8.15,6.53,12.67,19.27,17.14,28.27,2.61,5.32,8.22,26.73,16.19,23.8,6.78-2.5,4.05-16.25,3.47-21.8-2.42-17.72,1-46-13.8-59.56-5-4.44-16.15-4.83-22.62-5.85C155.84,106,134.56,103.6,114.08,103.54Z" />
        </svg>

        <span class="section-category-label">
          <?= __('肩こり') ?>
        </span>
      </div>

      <div class="section-category">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 293.88 224.96" fill="#ed7a9e" class="section-category-image">
          <path d="M43.88.39c-8.64,1.07-16.8,3.2-24,8.36-39.61,28.37-15.58,93.24,33,88C111.22,90.53,102.33-6.87,43.88.39Z" />
          <path d="M99.88,65c-9.48,22.76-25.66,32.37-48,40,13.87,42.63,51.31,73.24,55,120h99c0-22-2.4-44-13-64-4,3-8.54,8.53-13.24,3.7-8.26-8.48-1.24-19.59-6.46-28.7-10.3-17.7-27.94-31.94-42.3-46,11.71-.93,30.35-6.51,40.87,1,5.78,4.11,4.71,12.8,5.3,19,1.53,16,.83,34.7,5.83,50,8.29-2.59,9.36-13.73,11-21,4.57-18.29,9-36,9-55,0-6.69,1.36-15.6-4.22-20.57-6.59-5.87-21.4-6.06-29.78-6.43-15.56-.8-30.52-1-46,1.61C114.88,60,107.57,63.62,99.88,65Z" />
          <path d="M207.88,141h1l11-33,21,4,3-31c6.93.05,18.89,4.68,20-5-5.28-.71-23.15-7.19-27-2.4-5,6.14,2.29,19.81-4.59,25.7-4.74,4.07-13-2.64-18,0-3.19,1.72-3.13,7.65-3.56,10.65C209.32,120.19,207.88,130.62,207.88,141Z" />
          <path d="M240.88,117c-10.27,4.2-19.61,27.69-22,38l23.43-24.61L259.88,139l13-28c6,3.34,16.28,11.22,21,3-4.72-3.21-17.73-14.27-23.79-12.29-11.91,3.89-4.21,29.35-23.21,19.81A20.45,20.45,0,0,1,240.88,117Z" />
        </svg>

        <span class="section-category-label">
          <?= __('腰痛') ?>
        </span>
      </div>

      <div class="section-category">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 295.98 234.28" fill="#ed7a9e" class="section-category-image">
          <path d="M130.34,52.07l22,6c-5.67,2.68-14.06,6.71-16,13l18,7c-3,1.34-19,9.67-14.33,14,3.17,3,14.33.18,18.33-.29,17-2,34-4.34,51-7.71,5.51-1,13.46-4.64,19-3.73,5,.83,9,7,13,10,9,6.76,18.2,8.36,29,5.33,5.8-1.57,12.38-3.51,16.82-7.79,16.68-16.07,8.18-36.78-12.82-41.78,4.32-5.81,11.21-10.48,12.66-18C291.34,5.17,264.94-2.49,247.34.68c-10,1.79-16.57,7.83-21.53,16.39-2.11,3.63-3.17,9.56-6.86,12-3.29,2.13-8.81,1.78-12.61,2.28-9.07,1.19-18,3.1-27,4.72-12.19,2-24,5.34-36,8.37C138.1,45.77,132.08,46.34,130.34,52.07Z" />
          <path d="M39.34,205.07c.82,7,.5,15,4.81,21,12.5,17.15,35.55,4.11,44.75-9a30.78,30.78,0,0,0,4.35-28c-1.41-4.38-5.91-10.32-4.91-15,1.41-5.92,7.66-11.84,10.8-17,8.56-14,17.08-28.26,24.45-43,3.17-6.35,8.74-13.71,7.75-21l-20,9,4-20c-7-1-16,6.5-22,10,.42-3.18,4.82-17,.74-18.54S81.83,86.18,79.77,89.07c-9,12.61-17.43,25.68-25.22,39-3.47,5.8-6.21,13.81-10.84,18.68-4,4.12-12.15,3-17.37,3.94-10,1.88-17,7.38-21.62,16.38-7.47,14.71-8.17,41.35,13.62,43.81C25.78,211.72,32.65,207.67,39.34,205.07Z" />
        </svg>

        <span class="section-category-label">
          <?= __('捻挫、骨折') ?>
        </span>
      </div>

      <div class="section-category">
	<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 224.91 253.15" fill="#ed7a9e" class="section-category-image">
	  <path d="M99.91,69.15h1l11-33,21,4,3-31c6.93.06,18.88,4.68,20-5-5.28-.71-23.15-7.19-27-2.4-5,6.14,2.28,19.81-4.59,25.71-4.74,4.06-13-2.64-18,0-3.19,1.72-3.13,7.65-3.56,10.65C101.35,48.38,99.91,58.81,99.91,69.15Z" />
	  <path d="M132.91,45.15c-10.28,4.21-19.61,27.7-22,38l23.42-24.61,17.58,8.61,13-28c6,3.34,16.28,11.22,21,3-4.72-3.21-17.73-14.27-23.79-12.29-11.91,3.9-4.21,29.35-23.21,19.81A20.32,20.32,0,0,1,132.91,45.15Z" />
	  <path d="M36.91,33.59c-58,9.3-43.33,101.07,14,92.12,8.6-1.34,17.85-4.56,24.62-10.3C111.72,85.16,81.71,26.39,36.91,33.59Z" />
	  <path d="M138.91,161.15h1l11-33,21,4,3-31c6.93.06,18.88,4.68,20-5-5.28-.71-23.15-7.19-27-2.4-5,6.14,2.28,19.81-4.59,25.71-4.74,4.06-13-2.64-18,0-3.19,1.72-3.13,7.65-3.56,10.65C140.35,140.38,138.91,150.81,138.91,161.15Z" />
	  <path d="M21.91,125.15c-5.67,10-9.75,22-12.53,33-3,12.1-10.57,37-2,48,5.28,6.76,11.23,4.71,18.57,5.58,19,2.42,42.81-4.25,61-9.92,8.89-2.66,18.56-4.84,27-8.85,2.29-1.09,7-4,4.92-7.21-3-4.52-17.24-2.6-21.91-2.6-20,0-40,0-59-7v-1c6.94-1.36,14,1,21,2,15.8,1.76,33.18,4.14,49,2.28,4.64-.54,16.82-.59,16.29,6.81-.94,13-21.77,11.49-28.86,17.73-6.21,5.46-6.43,24.42-6.43,32.18,15.55-7.4,26.36-24.93,35.3-39,3.18-5,8.32-13,8.67-19,.31-5.4-5.77-11.83-8.69-16-7.9-11.24-16.28-22.58-25.28-33-3.31-4-7-9.43-12-11.63-6.7-2.94-18.48,8.17-25,10.38C48.2,132.55,35.15,129.32,21.91,125.15Z" />
	  <path d="M171.91,137.15c-10.28,4.21-19.61,27.7-22,38l23.42-24.61,17.58,8.61,13-28c6,3.34,16.28,11.22,21,3-4.72-3.21-17.73-14.27-23.79-12.29-11.91,3.9-4.21,29.35-23.21,19.81A20.32,20.32,0,0,1,171.91,137.15Z" />
	  <path d="M25.91,217.15l-3,36h89l-3-27c-5.44,3.83-11.71,13.8-19,13.71-11.72-.15-2.66-27.71-1-33.71C68.38,210.15,46.91,218.38,25.91,217.15Z" />
	</svg>

        <span class="section-category-label">
          <?= __('各種痛み') ?>
        </span>
      </div>

      <div class="section-category">
	<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 272 244.01" fill="#ed7a9e" class="section-category-image">
	  <path d="M189,82c-16.31-5.59-8-25.77-7.38-38a43.36,43.36,0,0,0-11.24-29.83A42.9,42.9,0,0,0,152,2.23c-21.59-7-45.54,2.86-55,23.78-10,22.12,1.72,52.42,26,59.07,9.21,2.52,20.56,2.52,30,1.52S185,95.45,189,82Z" />
	  <path d="M125,211c-4.09-17-26.81-30.56-26-49l11.45,16L130,207h1c2-14,17-23.71,24.67-35,.71-1,8.68-11.76,9.56-6.71.62,3.71-6.38,10-8.46,12.71-7.92,10.28-20.47,19-20.77,33,20.21-4.8,54.58-28.47,56.8-51,1.12-11.38-6.82-27.69-11.23-38-3.08-7.22-6.35-20.37-12.78-25-9.27-7-28.37-1.38-39.79-3.29-5.08-.71-11-3.71-16-3.09C101,92.44,91,110.56,85.4,120c-6.54,11-15.6,27-15.4,40C70.76,185,101.54,210.81,125,211Z" />
	  <path d="M213,157l-21,32,24.42-19.4L231,179c2.63-4.89,10.27-20.44,16-21,4.23-.61,11,5.35,15,7l2-5c-4-3-16-16.32-21.37-12.93-5.73,3.57-7,16.53-14.16,18.2C224.52,166.2,216.84,158.48,213,157Z" />
	  <path d="M8,169l2,5c3.95-1.65,10.77-7.61,14.91-7,5.82.56,13.46,16.11,16.09,21l14.72-9.4L80,198,59,166c-4,1.5-11.55,9.22-15.62,8.27-7-1.63-8.38-14.69-14-18.2C23.92,152.69,11.87,166,8,169Z" />
	  <path d="M235,196l-9.21-12.17L216,188.73,195,205c6.86-2,22.27-12.84,28.91-10,4.68,2,7.41,9,10.09,13,6.25-3,14.86-12.91,21.73-13.31,7.07-.41,7.27,11.94,16.27,8.31-1.61-4.42-9-21-14.72-20.26C250,183.74,242.56,193.62,235,196Z" />
	  <path d="M0,212c8.93,3.62,9.26-8.74,16.41-8.31C23,204.1,31.82,214.08,38,217c2.68-4,5.41-11,10-13,6.73-2.84,22,8,29,10L56,197.73l-9.79-4.89L37,205c-7.56-2.39-15-12.27-22.28-13.26C8.86,191,1.61,207.59,0,212Z" />
	  <path d="M177,194c-12,9.51-31.29,26-47,19-9.6,11.53-29-3.44-38-9l-3,40h96l-4.83-31Z" />
	</svg>

        <span class="section-category-label">
          <?= __('生理不良') ?>
        </span>
      </div>

      <div class="section-category">
	<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 204.02 262.88" fill="#ed7a9e" class="section-category-image">
	  <path d="M94.91,262.88h4c0-7.33.8-15-1.7-22-9.33-26.21-41.5-32.38-60.3-50C6.37,162-3.36,115.24,9.25,75.88c20.28-63.26,98.32-96,151.66-49.71,32.46,28.23,40.22,64.88,37,105.71-8.16,0-17.23-1.53-25,1.47-13.16,5.07-21.66,15.93-36,18.86-10,2-21.14-7.52-30-4.28-11,4-21.6,29.62-35.71,21.18C52.62,158,61.49,137.39,57.91,120.88h-1c-4,5.76-7.82,11.36-10.21,18-8.82,24.45,12,47.57,37.21,46.64,5.8-.21,13.66-9,18.78-7.31,4.13,1.39,5.8,11,7.22,14.67,8.79-3.5,6-24,6-32,26.62,11.78,39.44-10,62-17.89,5.54-1.9,11.31-.11,17-.11-6.83,21-17.76,39.34-35,53.53-16.39,13.5-41.18,20.47-51.47,40.47-4.31,8.39-4.53,16.82-4.53,26h3c0-37.87,37-45.6,61-67.17s33.93-52.65,35.91-83.83C208.23,42.66,137.91-18,70.91,5c-15.79,5.41-29.49,14.92-41,26.92a104.67,104.67,0,0,0-22.3,36c-16.22,44.62-6.38,95,28.3,128,16.7,16,48,22.43,57.47,45C96.16,247.48,94.91,255.88,94.91,262.88Z" />
	  <path d="M84.91,18.31c-54,7.74-60.52,92.71-6,105a54.34,54.34,0,0,0,20,1.29,45,45,0,0,0,23-10.58c10.38-8.87,18.28-19.35,20.67-33.13C148.61,46.19,120.68,13.17,84.91,18.31Z" />
	  <path d="M65.19,123.92c-4,2.36-4.28,9-4.28,13-.08,11,5.36,36,21,27.48a59.36,59.36,0,0,0,19.23-17.48c1.65-2.49,4.53-9-.38-10-6.35-1.44-13.07,9.77-19.54,6.76C75.65,141,77.88,116.38,65.19,123.92Z" />
	  <path d="M80.91,128.88l2,10c5.9-1,12.45-2,13-9Z" />
	</svg>

        <span class="section-category-label">
          <?= __('逆子治療') ?>
        </span>
      </div>

      <div class="section-category">
	<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 227.09 271" fill="#ed7a9e" class="section-category-image">
	  <path d="M186.92,0c1.94,6,9,3.53,14,4.68,7.66,1.76,19.68,9.34,22,17.32.92,3-1.24,7.27-5,6.63-3.17-.6-6.19-4.63-9-6.5-5.22-3.13-12-4.33-18-4.09-11,.43-18.54,9-5,14v1c-7,0-19.43,4.7-9,12.3,4,2.94,10,3.32,15,3.7v1c-5.57,1.6-17,4.09-20,9,10.84-.22,17.74-5.26,27-9.85C209.46,44,223.34,39.67,226.6,26,231.41,5.81,200.12,0,186.92,0Zm-6,23c11-2,27-2.73,33,9C205.12,32,184.18,33.43,180.92,23Zm-5,15c7.46-3,19.21-3.22,20,7C188.3,45,179.8,46,175.92,38Zm24,7-5-11,20,1C212.92,42,206.36,43.65,199.92,45Z" />
	  <path d="M54.92,77c4-.93,7.93-2.38,12-3.19a36.62,36.62,0,0,1,7-.79c6.87,0,11.21,4.38,7.38,11-4.43,7.64-13.08,13-19.38,19-2.35,2.21-6.38,4.63-7.07,8-1,5,4.07,12.16,6.81,16a53.66,53.66,0,0,0,46.26,22c17.37-1.28,33.39-10.89,42-26,2.64-4.35,7-11.78,5.36-17-3.36-10.66-22.8-16.81-22.36-29,.49-8.65,12.42-7.34,18-6-2-6-6.47-10.63-11-15C112.68,30,68.13,43.47,54.92,77Z" />
	  <path d="M44.92,271h127c0-22-4.15-43.33-7.27-65-1-6.58-6-20.74-3.41-26.82,2.07-4.91,11.38-8.65,15.68-11.51,18.54-12.36,48.81-27.44,37.33-54.67-3.33-7.85-9.34-10.64-16.33-14.8-12-7.13-24.74-15.38-38-19.84-4-1.36-17.77-6.36-21-1.77-2.37,3.61,5.89,9.41,8,11.41,8,7.7,16.51,15.23,25,22.58,2.31,2,8.46,6,7.39,9.75-.82,2.84-5.1,4.68-7.39,6.07-7.53,4.6-15.18,8.81-23,12.86-23.12,12-43,21.52-69,10.74-6-2.6-10.3-7.67-16-10.74-7.65-4.12-20-8.67-25.46-15.5-3.2-3.94,2.79-8,5.46-10.34,8.8-7.65,17.55-15.42,26-23.42,2-2,10.37-7.8,7.91-11.41-3.47-5.1-19.64,1.14-23.91,2.86C36.09,88.65,1.92,102.24.11,124c-2,23.26,23.62,35,39.81,45.67,4.3,2.86,13.6,6.6,15.68,11.51,2.32,5.87-2.32,19.48-3.26,25.82C49.19,228.26,44.92,249.45,44.92,271Z" />
	</svg>

        <span class="section-category-label">
          <?= __('精神不安') ?>
        </span>
      </div>

      <div class="section-category">
	<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 236.7 250.86" fill="#ed7a9e" class="section-category-image">
	  <path d="M53.53,22.92c-32,1.41-46,45-19,63.6,6.55,4.54,15.29,5.1,23,4.81C101.08,89.38,96.53,21.33,53.53,22.92Z" />
	  <path d="M142.53.82c-6.11-1.49-13.7-.49-20-.49v1c11.83,3.49,19.94,2,30,11.17C155.19,15,164,26.4,154.53,27c-3.68.31-8-5.42-11-7.16-7.12-4-19.3-5.29-27-1.53s.59,10.35,5,12v1c-7,0-19.43,4.69-9,12.29,4,3,10,3.32,15,3.71v1c-5.57,1.6-17,4.08-20,9,11.41-.24,18-6.17,28-10.31,5.34-2.22,11.41-2.36,15.6-6.91,3.21-3.48,10-11.31,11.08-15.78C164.75,13.65,151.51,3.33,142.53.82Zm-26,20.51c11-2,27-2.73,33,9C140.73,30.33,119.79,31.76,116.53,21.33Zm-5,15c7.46-3,19.21-3.22,20,7C123.91,43.33,115.41,44.33,111.53,36.33Zm24,7-5-11,20,1C148.53,40.33,142,42,135.53,43.33Z" />
	  <path d="M5.53,172.33c4.53-12,6.84-31.29,17-40l-1,28h51v-27c6.36,7.48,7.91,14.54,9.18,24,.31,2.29,1,7.54,3.82,8.08,3.71.65,3.82-7,4-9.08,1.17-10,1.94-19-.35-29-2-8.56-11.25-27.85-20.65-30-6-1.55-13.56,1.62-20,.7-5-.7-12.25-5.41-17-4.55-23,4.14-27.65,37-30.13,54.85C.46,155.08-2.74,169.82,5.53,172.33Z" />
	  <path d="M196.53,95.33c1.94,6,9,3.53,14,4.68,7.66,1.76,19.68,9.33,22,17.32.92,3-1.24,7.27-5,6.62-3.17-.59-6.19-4.62-9-6.49-5.22-3.13-12-4.33-18-4.09-11,.43-18.54,9-5,14v1c-7.05,0-19.43,4.69-9,12.29,4,2.95,10,3.32,15,3.71v1c-5.57,1.6-17,4.08-20,9,10.84-.23,17.74-5.26,27-9.85,10.54-5.15,24.42-9.48,27.68-23.15C241,101.14,209.73,95.33,196.53,95.33Zm-6,23c11-2,27-2.73,33,9C214.73,127.33,193.79,128.76,190.53,118.33Zm-5,15c7.46-3,19.21-3.22,20,7C197.91,140.33,189.41,141.33,185.53,133.33Zm24,7-5-11,20,1C222.53,137.33,216,139,209.53,140.33Z" />
	  <path d="M162.53,159.84c-5,.49-9.72,1.49-14,4-2.56,1.53-5.76,5.31-9,4.89-3.78-.37-7.3-4.9-11-6.28-13-4.8-27.74-1.43-36.81,8.91-21.86,25,6.07,58.44,27.81,71,6.45,3.52,14.24,8.8,22,8.52,23-.81,49.88-26.87,54.48-48.52C200.75,180,187.12,158.33,162.53,159.84Z" />
	</svg>

        <span class="section-category-label">
          <?= __('その他身体や<br>心の不調') ?>
        </span>
      </div>
    </div>
  </section>

  <section id="section-4" class="section" data-section-index="4">
    <h1 class="section-title">
      <?= __('メディア紹介') ?>
    </h1>

    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('雑誌に掲載されました。')),
      ]) ?>
    </div>

    <div class="section-gallery">
      <div class="section-gallery-image-list">
        <img src="<?= $this->Url->image('magazine.bst.201406.jpg') ?>" width="197" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.hanakowest.beautyspecial.jpg') ?>" width="202" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.richer.200904.jpg') ?>" width="203" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.savvy.200710.jpg') ?>" width="199" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.savvy.200704.jpg') ?>" width="200" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.savvy.200501.jpg') ?>" width="186" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.hanakowest.200704.jpg') ?>" width="202" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.hanakowest.200702.jpg') ?>" width="187" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.savvy.200610.jpg') ?>" width="187" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('magazine.savvy.200512.jpg') ?>" width="186" height="256" loading="lazy" class="section-gallery-image">
      </div>
    </div>
  </section>

  <section id="section-5" class="section" data-section-index="5">
    <h1 class="section-title">
      <?= __('アクセス') ?>
    </h1>

    <img src="<?= $this->Url->image('map.png') ?>" width="" height="" loading="lazy" class="section-image">

    <div class="section-content">
      <p>
	<?= __('南海バス北野田線 西口園バス停から徒歩2分') ?>

	<br>

        <a href="">
          <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" width="16" height="16" fill="currentColor">
            <path fill-rule="evenodd" d="M8.636 3.5a.5.5 0 0 0-.5-.5H1.5A1.5 1.5 0 0 0 0 4.5v10A1.5 1.5 0 0 0 1.5 16h10a1.5 1.5 0 0 0 1.5-1.5V7.864a.5.5 0 0 0-1 0V14.5a.5.5 0 0 1-.5.5h-10a.5.5 0 0 1-.5-.5v-10a.5.5 0 0 1 .5-.5h6.636a.5.5 0 0 0 .5-.5z" />
            <path fill-rule="evenodd" d="M16 .5a.5.5 0 0 0-.5-.5h-5a.5.5 0 0 0 0 1h3.793L6.146 9.146a.5.5 0 1 0 .708.708L15 1.707V5.5a.5.5 0 0 0 1 0v-5z" />
          </svg>

          <?= __('西口園バス停の時刻表をNAVITIMEで見る') ?>
	</a>
      </p>
    </div>
  </section>

  <section id="section-6" class="section" data-section-index="6">
    <h1 class="section-title">
      <?= __('診療時間') ?>
    </h1>

    <div class="section-content">
      <p>
	<?= __('午前： 9:00 - 12:30') ?>

        <br>

	<?= __('午後： 15:00 - 21:00') ?>
      </p>

      <p>
        <?= __('休診日：木・土・日曜日および祝日') ?>
      </p>
    </div>
  </section>

  <section id="section-7" class="section" data-section-index="7">
    <h1 class="section-title">
      <?= __('診療費') ?>
    </h1>

    <div class="section-content">
      <p>
	<?= __('4000円') ?>

        <br>

	<?= __('（初診 4500円）') ?>
      </p>
    </div>
  </section>

  <section id="section-8" class="section" data-section-index="8">
    <h1 class="section-title">
      <?= __('けんこかわら版') ?>
    </h1>

    <div class="section-content">
      <?= implode('', [
        sprintf('<p>%s</p>', __('季節の養生や健康についてのお話を不定期で書いております。')),
      ]) ?>
    </div>

    <div class="section-gallery">
      <div class="section-gallery-image-list">
        <img src="<?= $this->Url->image('kenkokawaraban.2020spring.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201909.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201907.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201902.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201812.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.2018summer.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201808.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">

        <img src="<?= $this->Url->image('kenkokawaraban.201806.jpg') ?>" width="173" height="256" loading="lazy" class="section-gallery-image">
      </div>
    </div>

    <div class="section-content">
      <ul>
        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.2020spring.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０２０年春号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201909.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１９年９月号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201907.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１９年７月号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201902.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１９年２月号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201812.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１８年１２月号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.2018summer.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１８年夏号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201808.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１８年８月号') ?>
          </a>
        </li>

        <li>
          <a href="<?= $this->Url->assetUrl('kenkokawaraban.201806.pdf', ['pathPrefix' => 'pdf/']) ?>" target="kenkokawaraban">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 384 512" width="16" height="16" fill="currentColor">
              <path d="M369.9 97.9L286 14C277 5 264.8-.1 252.1-.1H48C21.5 0 0 21.5 0 48v416c0 26.5 21.5 48 48 48h288c26.5 0 48-21.5 48-48V131.9c0-12.7-5.1-25-14.1-34zM332.1 128H256V51.9l76.1 76.1zM48 464V48h160v104c0 13.3 10.7 24 24 24h104v288H48zm250.2-143.7c-12.2-12-47-8.7-64.4-6.5-17.2-10.5-28.7-25-36.8-46.3 3.9-16.1 10.1-40.6 5.4-56-4.2-26.2-37.8-23.6-42.6-5.9-4.4 16.1-.4 38.5 7 67.1-10 23.9-24.9 56-35.4 74.4-20 10.3-47 26.2-51 46.2-3.3 15.8 26 55.2 76.1-31.2 22.4-7.4 46.8-16.5 68.4-20.1 18.9 10.2 41 17 55.8 17 25.5 0 28-28.2 17.5-38.7zm-198.1 77.8c5.1-13.7 24.5-29.5 30.4-35-19 30.3-30.4 35.7-30.4 35zm81.6-190.6c7.4 0 6.7 32.1 1.8 40.8-4.4-13.9-4.3-40.8-1.8-40.8zm-24.4 136.6c9.7-16.9 18-37 24.7-54.7 8.3 15.1 18.9 27.2 30.1 35.5-20.8 4.3-38.9 13.1-54.8 19.2zm131.6-5s-5 6-37.3-7.8c35.1-2.6 40.9 5.4 37.3 7.8z" />
            </svg>

            <?= __('２０１８年６月号') ?>
          </a>
        </li>
      </ul>
    </div>
  </section>

  <div class="primary-action-container">
    <a href="tel:+81722375695" class="primary-action">
      <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" width="16" height="16" fill="currentColor">
        <path d="M3.654 1.328a.678.678 0 0 0-1.015-.063L1.605 2.3c-.483.484-.661 1.169-.45 1.77a17.568 17.568 0 0 0 4.168 6.608 17.569 17.569 0 0 0 6.608 4.168c.601.211 1.286.033 1.77-.45l1.034-1.034a.678.678 0 0 0-.063-1.015l-2.307-1.794a.678.678 0 0 0-.58-.122l-2.19.547a1.745 1.745 0 0 1-1.657-.459L5.482 8.062a1.745 1.745 0 0 1-.46-1.657l.548-2.19a.678.678 0 0 0-.122-.58L3.654 1.328zM1.884.511a1.745 1.745 0 0 1 2.612.163L6.29 2.98c.329.423.445.974.315 1.494l-.547 2.19a.678.678 0 0 0 .178.643l2.457 2.457a.678.678 0 0 0 .644.178l2.189-.547a1.745 1.745 0 0 1 1.494.315l2.306 1.794c.829.645.905 1.87.163 2.611l-1.034 1.034c-.74.74-1.846 1.065-2.877.702a18.634 18.634 0 0 1-7.01-4.42 18.634 18.634 0 0 1-4.42-7.009c-.362-1.03-.037-2.137.703-2.877L1.885.511z" />
      </svg>

      <?= __('お気軽にお問合せください') ?>
    </a>
  </div>

  <iframe allowfullscreen src="<?= sprintf('https://www.google.com/maps/embed/v1/place?%s', implode('&', [
    'key=AIzaSyAq92LVBH_q56vksTJoxfFtoApIJSlhKT4',
    'q=小谷はり灸所',
    'zoom=18',
  ])) ?>" class="embedded-map"></iframe>
</main>

<footer class="footer">
  <div class="footer-shop-name">
    <?= __('小谷はり灸所') ?>
  </div>

  <div class="footer-information" data-type="address">
    <?= __('大阪府堺市東区大美野 158-23') ?>
  </div>

  <div class="footer-information" data-type="access">
    <?= __('南海バス北野田線 西口園バス停から徒歩2分') ?>
  </div>

  <div class="footer-information" data-type="tel">
    <a href="tel:+81722375695">
      <?= __('072-237-5695') ?>
    </a>
  </div>
</footer>

<?php $this->append('css'); ?>
<style>
.header {
  position: fixed;
  z-index: 100;
  top: 0;
  right: 0;
  left: 0;
  display: grid;
  grid-template-rows: 52px;
  grid-template-columns: 16px 1fr 52px;
  align-items: center;
  background-color: rgba(255, 255, 255, 0.75);
}

.page-title {
  grid-column-start: 2;
  font-size: 20px;
  font-weight: 800;
  line-height: 20px;
  letter-spacing: 4px;
}

.toggle-navigation-button {
  position: relative;
  box-sizing: content-box;
  padding: 16px;
  width: 20px;
  height: 20px;
}

.toggle-navigation-button-label {
  position: absolute;
  right: 0;
  bottom: 4px;
  left: 0;
  font-size: 10px;
  line-height: 10px;
}

.navigation-container {
  position: fixed;
  z-index: 10;
}

.navigation-container[data-state="shown"] {
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
}

.navigation-container[data-state="hidden"] {
}

.navigation-background-layer {
  position: fixed;
  width: calc((200vw + 200vh));
  height: calc((200vw + 200vh));
  top: calc(50vh - (100vw + 100vh));
  left: 100vw;
  background-color: rgba(0, 0, 0, 0.75);
  border-radius: 50%;
  transition-duration: 0s;
}

.navigation-container[data-state="shown"] .navigation-background-layer {
  left: calc(100vw - (100vw + 100vh));
  transition-property: left;
  transition-duration: 0.5s;
}

.navigation-container[data-state="hidden"] .navigation-background-layer {
  left: 100vw;
  transition-property: left;
  transition-duration: 0.5s;
}

.navigation-content {
  position: fixed;
  top: 52px;
  bottom: 0;
  left: 100vw;
  display: flex;
  flex-direction: column;
  width: calc(100vw - 24px);
  background-color: #ffffff;
  overflow-y: auto;
}

.navigation-container[data-state="shown"] .navigation-content {
  left: 24px;
  transition-property: left;
  transition-duration: 0.5s;
  transition-delay: 0.2s;
}

.navigation-container[data-state="hidden"] .navigation-content {
  left: 100vw;
  transition-property: left;
  transition-duration: 0.5s;
  transition-delay: 0s;
}

.navigation-action-list {
  flex: 1;
}

.navigation-action {
  position: relative;
  display: block;
  padding: 16px;
  background-color: #ffffff;
  color: #ed7a9e;
  font-size: 16px;
  font-weight: 600;
  border-bottom: solid 1px rgb(237, 122, 158, 0.25);
}

.navigation-action::after {
  position: absolute;
  top: 0;
  right: 8px;
  bottom: 0;
  margin: auto;
  width: 16px;
  height: 16px;
  background-image: url(<?= sprintf('data:image/svg+xml;charset=utf8,%s', rawurlencode(implode(' ', [
    '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" width="16" height="16" fill="#ed7a9e">',
    '  <path fill-rule="evenodd" d="M4.646 1.646a.5.5 0 0 1 .708 0l6 6a.5.5 0 0 1 0 .708l-6 6a.5.5 0 0 1-.708-.708L10.293 8 4.646 2.354a.5.5 0 0 1 0-.708z" />',
    '</svg>',
  ]))) ?>);
  background-position: center;
  background-size: contain;
  background-repeat: no-repeat;
  content: "";
}

.navigation-shop-name {
  margin: 24px 0 16px;
  padding: 0 16px;
  font-size: 16px;
  font-weight: 800;
}

.navigation-contact-list {
  margin: 16px 0;
  padding: 0 16px;
}

.navigation-contact {
  position: relative;
  display: block;
  padding-left: 24px;
  color: #333333;
  font-size: 12px;
  font-weight: 600;
  text-decoration: none;
}

.navigation-contact:not(:first-child) {
  margin-top: 16px;
}

.navigation-contact::before {
  position: absolute;
  top: 0;
  left: 0;
  width: 16px;
  height: 16px;
  background-position: center;
  background-size: contain;
  background-repeat: no-repeat;
  content: "";
}

.navigation-contact[data-icon="pin"]::before {
  background-image: url(<?= sprintf('data:image/svg+xml;charset=utf8,%s', rawurlencode(implode(' ', [
    '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="#333333">',
    '  <path d="M12.166 8.94c-.524 1.062-1.234 2.12-1.96 3.07A31.493 31.493 0 0 1 8 14.58a31.481 31.481 0 0 1-2.206-2.57c-.726-.95-1.436-2.008-1.96-3.07C3.304 7.867 3 6.862 3 6a5 5 0 0 1 10 0c0 .862-.305 1.867-.834 2.94zM8 16s6-5.686 6-10A6 6 0 0 0 2 6c0 4.314 6 10 6 10z"/>',
    '  <path d="M8 8a2 2 0 1 1 0-4 2 2 0 0 1 0 4zm0 1a3 3 0 1 0 0-6 3 3 0 0 0 0 6z"/>',
    '</svg>',
  ]))) ?>);
}

.navigation-contact[data-icon="walk"]::before {
  background-image: url(<?= sprintf('data:image/svg+xml;charset=utf8,%s', rawurlencode(implode(' ', [
    '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="#333333">',
    '  <path d="M14.082 2.182a.5.5 0 0 1 .103.557L8.528 15.467a.5.5 0 0 1-.917-.007L5.57 10.694.803 8.652a.5.5 0 0 1-.006-.916l12.728-5.657a.5.5 0 0 1 .556.103zM2.25 8.184l3.897 1.67a.5.5 0 0 1 .262.263l1.67 3.897L12.743 3.52 2.25 8.184z" />',
    '</svg>',
  ]))) ?>);
}

.navigation-contact[data-icon="tel"]::before {
  background-image: url(<?= sprintf('data:image/svg+xml;charset=utf8,%s', rawurlencode(implode(' ', [
    '<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="#333333">',
    '  <path d="M3.654 1.328a.678.678 0 0 0-1.015-.063L1.605 2.3c-.483.484-.661 1.169-.45 1.77a17.568 17.568 0 0 0 4.168 6.608 17.569 17.569 0 0 0 6.608 4.168c.601.211 1.286.033 1.77-.45l1.034-1.034a.678.678 0 0 0-.063-1.015l-2.307-1.794a.678.678 0 0 0-.58-.122l-2.19.547a1.745 1.745 0 0 1-1.657-.459L5.482 8.062a1.745 1.745 0 0 1-.46-1.657l.548-2.19a.678.678 0 0 0-.122-.58L3.654 1.328zM1.884.511a1.745 1.745 0 0 1 2.612.163L6.29 2.98c.329.423.445.974.315 1.494l-.547 2.19a.678.678 0 0 0 .178.643l2.457 2.457a.678.678 0 0 0 .644.178l2.189-.547a1.745 1.745 0 0 1 1.494.315l2.306 1.794c.829.645.905 1.87.163 2.611l-1.034 1.034c-.74.74-1.846 1.065-2.877.702a18.634 18.634 0 0 1-7.01-4.42 18.634 18.634 0 0 1-4.42-7.009c-.362-1.03-.037-2.137.703-2.877L1.885.511z" />',
    '</svg>',
  ]))) ?>);
}

.main {
  margin-top: 52px;
}

.section {
  position: relative;
}

.section[data-section-index="0"] {
  display: flex;
  flex-direction: column;
  justify-content: flex-end;
  align-items: stretch;
  padding: 24px;
  min-height: 360px;
  background-image: url(<?= $this->Url->image('cover.20211027.jpg') ?>);
  background-size: cover;
  background-position: center;
  background-repeat: no-repeat;
}

.section[data-section-index="0"] .section-title {
  font-size: 20px;
  font-weight: 800;
  line-height: 20px;
  text-align: center;
  letter-spacing: 4px;
  text-shadow: 0 0 4px #ffffff;
}

.section[data-section-index="1"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="2"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="2"] .section-title {
  font-size: 24px;
}

.section[data-section-index="2"] .section-subtitle {
  position: relative;
  margin: 32px 0 16px;
  padding-left: 48px;
  font-size: 20px;
}

.section[data-section-index="2"] .section-subtitle::before {
  position: absolute;
  top: -8px;
  left: 0;
  display: block;
  padding: 20px 4px 4px 20px;
  background-color: #ed7a9e;
  border-radius: 4px;
  color: rgba(255, 255, 255, 0.75);
  font-size: 12px;
  content: "／3";
}

.section[data-section-index="2"] .section-subtitle::after {
  position: absolute;
  top: -8px;
  left: 8px;
  display: block;
  color: #ffffff;
  font-size: 24px;
}

.section[data-section-index="2"] .section-subtitle:nth-of-type(1)::after {
  content: "1";
}

.section[data-section-index="2"] .section-subtitle:nth-of-type(2)::after {
  content: "2";
}

.section[data-section-index="2"] .section-subtitle:nth-of-type(3)::after {
  content: "3";
}

.section[data-section-index="3"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="3"] .section-title {
  font-size: 24px;
}

.section[data-section-index="4"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="4"] .section-title {
  font-size: 24px;
}

.section[data-section-index="4"] .section-content {
  margin-top: 16px;
}

.section[data-section-index="5"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="5"] .section-title {
  font-size: 24px;
}

.section[data-section-index="5"] .section-content {
  margin-top: 16px;
}

.section[data-section-index="6"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="6"] .section-title {
  font-size: 24px;
}

.section[data-section-index="6"] .section-content {
  margin-top: 16px;
}

.section[data-section-index="7"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="7"] .section-title {
  font-size: 24px;
}

.section[data-section-index="7"] .section-content {
  margin-top: 16px;
}

.section[data-section-index="8"] {
  margin: 0 auto;
  padding: 24px;
  max-width: 480px;
}

.section[data-section-index="8"] .section-title {
  font-size: 24px;
}

.section[data-section-index="8"] .section-content {
  margin-top: 16px;
}

.section-image {
  display: block;
  width: 100%;
}

.section-gallery {
  margin-top: 16px;
  margin-left: calc(((100vw - 100%) * -1) / 2);
  margin-bottom: 16px;
  width: 100vw;
  overflow-x: auto;
}

.section-gallery-image-list {
  display: flex;
  flex-wrap: nowrap;
}

.section-gallery-image {
  display: block;
  padding: 4px;
  height: 256px;
}

.section-category-list {
  display: grid;
  grid-template-rows: repeat(3, 120px);
  grid-template-columns: repeat(2, 1fr);
  grid-row-gap: 8px;
  grid-column-gap: 8px;
  margin: 16px 0;
}

@media (min-width: 480px) {
  .section-category-list {
    grid-template-columns: repeat(3, 1fr);
  }
}

.section-category {
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  align-items: stretch;
  padding: 8px;
  border: solid 2px #ed7a9e;
  border-radius: 4px;
}

.section-category-image {
  margin: 0 auto;
  width: 64px;
  height: 64px;
}

.section-category-label {
  color: #ed7a9e;
  font-size: 14px;
  font-weight: 800;
  text-align: center;
  line-height: 1;
}

.section-content p:not(:first-child) {
  margin-top: 24px;
}

.embedded-map {
  display: block;
  width: 100%;
  height: 50vh;
  border: none;
}

.primary-action-container {
  position: fixed;
  right: 0;
  bottom: env(safe-area-inset-bottom);
  left: 0;
  padding: 16px;
}

.primary-action {
  display: block;
  padding: 12px 0;
  background-color: #ed7a9e;
  border-radius: 8px;
  color: #ffffff;
  font-weight: 800;
  text-align: center;
  text-decoration: none;
  box-shadow: 0px 3px 1px -2px rgb(0 0 0 / 20%), 0px 2px 2px 0px rgb(0 0 0 / 14%), 0px 1px 5px 0px rgb(0 0 0 / 12%);
}

.footer {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  grid-row-gap: 8px;
  margin: 0 auto;
  padding: 48px 24px 50vh;
  background-color: #ed7a9e;
}

.footer-shop-name {
  color: #ffffff;
  font-size: 16px;
  font-weight: 800;
}

.footer-information {
  grid-column-start: 2;
  grid-column-end: 3;
  color: #ffffff;
  text-align: right;
}

.footer-information a {
  color: #ffffff;
  text-decoration: none;
}
</style>
<?php $this->end(); ?>

<?php $this->append('script'); ?>
<script>
window.addEventListener("DOMContentLoaded", (event) => {
  const toggleNavigationButton = document.querySelector("#toggle-navigation-button");
  const navigationContainer = document.querySelector("#navigation-container");
  const navigationAnchors = document.querySelectorAll(".navigation-action");
  const sectionGalleries = document.querySelectorAll(".section-gallery");

  window.requestAnimationFrame(animate);

  window.addEventListener("scroll", (event) => {
    if (navigationContainer.dataset.state === "shown") {
      window.scrollTo({
        top: navigationContainer.dataset.scrollY,
        left: navigationContainer.dataset.scrollX,
        behavior: "smooth",
      });

      return false;
    }
  });

  toggleNavigationButton.addEventListener("click", (event) => {
    navigationContainer.dataset.scrollX = window.scrollX;
    navigationContainer.dataset.scrollY = window.scrollY;
    navigationContainer.dataset.state = navigationContainer.dataset.state === "shown" ? "hidden" : "shown";
  });

  for (const navigationAnchor of navigationAnchors) {
    navigationAnchor.addEventListener("click", (event) => {
      const target = document.querySelector(event.currentTarget.dataset.target);

      if (target) {
        const rect = target.getBoundingClientRect();

        navigationContainer.dataset.scrollX = window.scrollX + rect.left - 52;
        navigationContainer.dataset.scrollY = window.scrollY + rect.top - 52;

        window.dispatchEvent(new Event("scroll"));

        navigationContainer.dataset.state = "hidden";
      }
    });
  }

  function animate(timestamp) {
    for (const sectionGallery of sectionGalleries) {
      const rect = sectionGallery.getBoundingClientRect();
      const isVisible = (rect.top >= 0 && rect.bottom <= window.innerHeight);

      if (isVisible) {
        sectionGallery.scrollLeft = sectionGallery.scrollLeft + 0.5;
      }
    }

    window.requestAnimationFrame(animate);
  }
});
</script>
<?php $this->end(); ?>

